kpnair99/PIC18F97J94--All-purpose-board/Codes/PIC18F97J94_SPI_DAC/newfile.c

// PIC18F97J94 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1L
#pragma config STVREN = ON      // Stack Overflow/Underflow Reset (Enabled)
#pragma config XINST = OFF       // Extended Instruction Set (Enabled)

// CONFIG1H
#pragma config BOREN = ON       // Brown-Out Reset Enable (Controlled with SBOREN bit, disabled in Deep Sleep)
#pragma config BORV = 1         // Brown-out Reset Voltage (1.8V)
#pragma config CP0 = OFF        // Code Protect (Program memory is not code-protected)

// CONFIG2L
#pragma config FOSC = FRCDIV    // Oscillator (Fast RC Oscillator with Postscaler (FRCDIV))
#pragma config SOSCSEL = LOW    // T1OSC/SOSC Power Selection Bits (Low Power T1OSC/SOSC circuit selected)
#pragma config CLKOEN = ON      // Clock Out Enable Bit (CLKO output enabled on the RA6 pin)
#pragma config IESO = ON        // Internal External Oscillator Switch Over Mode (Enabled)

// CONFIG2H
#pragma config PLLDIV = NOPLL   // PLL Frequency Multiplier Select bits (No PLL used - PLLGO bit not available to user)

// CONFIG3L
#pragma config POSCMD = NONE    // Primary Oscillator Select (Primary oscillator disabled)
#pragma config FSCM = CSDCMD    // Clock Switching and Monitor Selection Configuration bits (Clock switching is disabled, fail safe clock monitor is disabled)

// CONFIG3H

// CONFIG4L
#pragma config WPFP = WPFP255   // Write/Erase Protect Page Start/End Boundary (Write Protect Program Flash Page 255)

// CONFIG4H
#pragma config WPDIS = WPDIS    // Segment Write Protection Disable (Disabled)
#pragma config WPEND = WPENDMEM // Segment Write Protection End Page Select (Write Protect from WPFP to the last page of memory)
#pragma config WPCFG = WPCFGDIS // Write Protect Configuration Page Select (Disabled)

// CONFIG5L
#pragma config T5GSEL = T5G     // TMR5 Gate Select bit (TMR5 Gate is driven by the T5G input)
#pragma config CINASEL = DEFAULT// CxINA Gate Select bit (C1INA and C3INA are on their default pin locations)
#pragma config EASHFT = ON      // External Address Shift bit (Address Shifting enabled)
#pragma config ABW = MM         // Address Bus Width Select bits (8-bit address bus)
#pragma config BW = 16          // Data Bus Width (16-bit external bus mode)
#pragma config WAIT = OFF       // External Bus Wait (Disabled)

// CONFIG5H
#pragma config IOL1WAY = ON     // IOLOCK One-Way Set Enable bit (Once set, the IOLOCK bit cannot be cleared)
#pragma config LS48MHZ = SYSX2  // USB Low Speed Clock Select bit (Divide-by-2 (System clock must be 12 MHz))
#pragma config MSSPMSK2 = MSK7  // MSSP2 7-Bit Address Masking Mode Enable bit (7 Bit address masking mode)
#pragma config MSSPMSK1 = MSK7  // MSSP1 7-Bit Address Masking Mode Enable bit (7 Bit address masking mode)

// CONFIG6L
#pragma config WDTWIN = PS25_0  // Watch Dog Timer Window (Watch Dog Timer Window Width is 25 percent)
#pragma config WDTCLK = FRC     // Watch Dog Timer Clock Source (Use FRC when WINDIS = 0, system clock is not INTOSC/LPRC and device is not in Sleep; otherwise, use INTOSC/LPRC)
#pragma config WDTPS = 32768    // Watchdog Timer Postscale (1:32768)

// CONFIG6H
#pragma config WDTEN = SWDTDIS  // Watchdog Timer Enable (WDT enabled in hardware; SWDTEN bit disabled)
#pragma config WINDIS = WDTSTD  // Windowed Watchdog Timer Disable (Standard WDT selected; windowed WDT disabled)
#pragma config WPSA = 128       // WDT Prescaler (WDT prescaler ratio of 1:128)

// CONFIG7L
#pragma config RETEN = OFF      // Retention Voltage Regulator Control Enable (Retention not available)
#pragma config VBTBOR = ON      // VBAT BOR Enable (VBAT BOR is enabled)
#pragma config DSBOREN = ON     // Deep Sleep BOR Enable (BOR enabled in Deep Sleep)
#pragma config DSBITEN = ON     // DSEN Bit Enable bit (Deep Sleep is controlled by the register bit DSEN)

// CONFIG7H

// CONFIG8L
#pragma config DSWDTPS = DSWDTPS1F// Deep Sleep Watchdog Timer Postscale Select (1:68719476736 (25.7 Days))

// CONFIG8H
#pragma config DSWDTEN = ON     // Deep Sleep Watchdog Timer Enable (DSWDT Enabled)
#pragma config DSWDTOSC = LPRC  // DSWDT Reference Clock Select (DSWDT uses LPRC as reference clock)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#define _XTAL_FREQ 8000000UL  // Adjust as per your oscillator
#include <stdint.h>
#include <pic18f97j94.h>

// === Chip Select Control ===
#define DAC_CS           LATCbits.LATC2
#define DAC_CS_DIR       TRISCbits.TRISC2

// === MCP4822 Command Bits ===
// Channel A = 0, Channel B = 1
// Buffer: 1 = Buffered VREF
// Gain: 1 = 1x (full-scale), 0 = 2x
// Shutdown: 1 = Active, 0 = Shutdown
#define DAC_CMD 0x3FFF//0x3C7A
//uint8_t voltage;
void SPI_CS_Low() {
    DAC_CS = 0;
    __delay_us(1);
}

void SPI_CS_High() {
    DAC_CS = 1;
    __delay_us(1);
}


void SPI2_PinInit(void);
void SPI2_Init(void);
void SPI2_Write(uint8_t data);
void DAC_Write(uint16_t value12); // Writes to Channel A

// === Configure PPS and CS pin ===

void SPI2_PinInit(void) {
    ANCON1 = ANCON2 = ANCON3 = 0x00;

    TRISAbits.TRISA1 = 1; // SDI2
    TRISFbits.TRISF6 = 0; // SDO2
    TRISFbits.TRISF7 = 0; // SCK2
    DAC_CS_DIR = 0; // CS output

    // Unlock PPS
    INTCONbits.GIE = 0;
    EECON2 = 0x55;
    EECON2 = 0xAA;
    OSCCON2bits.IOLOCK = 0;
    RPINR12_13bits.SDI2R = 0; // RA1 = SDI2
    RPOR40_41bits.RPO40R = 4; // RF6 = SDO2
    RPOR38_39bits.RPO38R = 5; // RF7 = SCK2
    EECON2 = 0x55;
    EECON2 = 0xAA;
    OSCCON2bits.IOLOCK = 1;
    INTCONbits.GIE = 1;
}

// === SPI2 Module Setup ===

void SPI2_Init() {
    SSP2CON1bits.SSPEN = 1;
    SSP2STATbits.CKE = 1;
    SSP2CON1bits.CKP = 0;
    SSP2STATbits.SMP = 0;
    SSP2CON3 = 0x10;
}

// === Write 1 byte via SPI2 ===

void SPI2_Write(uint8_t data) {
    SSP2BUF = data;
    while (!SSP2STATbits.BF); // Wait for transmit complete
}

// === Write 12-bit value to MCP4822, Channel A ===

void DAC_Write(uint16_t value12) {
    uint16_t cmd = DAC_CMD; // Ch A, buffered, 1x, active

    SPI_CS_Low(); // Start SPI frame
    SPI2_Write(cmd >> 8); // Send MSB
    SPI2_Write(cmd & 0xFF); // Send LSB
    SPI_CS_High(); // End SPI frame
    
   
}

void main(void) {
    OSCCON3bits.IRCF = 0b001;
    SPI2_PinInit();
    SPI2_Init();
    while (1) {
        //        DAC_Write(0);       // 0V
        //        __delay_ms(1000);
        //        DAC_Write(2048);    // Mid-scale
        //        __delay_ms(1000);
       DAC_Write(DAC_CMD); // Full-scale
        __delay_ms(1000);
    }
}